[LEBVenator X2CharacterTemplate]
strCharacterName="Venator"

[VenatorFeedback X2AbilityTemplate]
LocFriendlyName="Feedback"
LocLongDescription="Uses the target's psionic potential to create a devastating psionic blast."
LocHelpText="Deal area damage based on the target's Psi Stat."
LocFlyOverText="Feedback"

[VenatorParalyze X2AbilityTemplate]
LocFriendlyName="Paralyze"
LocLongDescription="This debilitating attack stuns enemies around the caster, removing one of their actions for the next turn."
LocHelpText="Stuns targets in an area removing one Action."
LocFlyOverText="Paralyze"

[VenatorImmunities X2AbilityTemplate]
LocFriendlyName="Immunities"
LocLongDescription="The Venator is immune to fire, poison, acid and mind altering effects."
LocHelpText="The Venator is immune to fire, poison, acid and mental effects."
LocFlyOverText="Venator Immunities"

[VenatorTeleport X2AbilityTemplate]
LocFriendlyName="Teleport"
LocLongDescription="The Venator can teleport to distant locations instead of moving directly. Bypasses all overwatch and reaction fire."
LocHelpText="Teleport to a new location. Bypasses all overwatch and reaction fire."
LocFlyOverText="Teleport"

[LEBLGSR X2SitRepTemplate]
FriendlyName="The Hunt"
Description="Psionic hunting squads have been spotted in the area. Expect additional forces."

[LEBLGSREffect X2SitRepEffect_ModifyBattleState_LEBLGSR]
FriendlyName="The Hunt""
Description="Psionic hunting squads have been spotted in the area. Expect additional forces."

[Riftkeeper X2CharacterTemplate]
strCharacterName="Riftkeeper"

[RiftkeeperMk2 X2CharacterTemplate]
strCharacterName="Riftkeeper Mk II"

[Riftportal X2AbilityTemplate]
LocFriendlyName="Open small Rift"
LocLongDescription="The Riftkeeper summons reinforcement from an unknown place."
LocHelpText="Summon weak reinforcements!"
LocFlyOverText="Rift"

[Riftportalstrong X2AbilityTemplate]
LocFriendlyName="Open large Rift"
LocLongDescription="The Riftkeeper summons reinforcement from an unknown place."
LocHelpText="Summon strong reinforcements!"
LocFlyOverText="Rift"

[Riftportalstronger X2AbilityTemplate]
LocFriendlyName="Open huge Rift"
LocLongDescription="The Riftkeeper summons reinforcement from an unknown place."
LocHelpText="Summon strongest reinforcements!"
LocFlyOverText="Rift"

[RKSustain X2AbilityTemplate]
LocFriendlyName="Sustain"
LocLongDescription="If the Riftkeeper takes enough damage to be killed, is is immediately put in Stasis for 1 turn and its health is only reduced to 1 HP. This can only happen once per mission."
LocHelpText="If the Riftkeeper takes enough damage to be killed, is is immediately put in Stasis for 1 turn and its health is only reduced to 1 HP. This can only happen once per mission."
LocFlyOverText="Sustain"

[RKSustainTriggered X2AbilityTemplate]
LocFriendlyName="Sustained"
LocLongDescription="The Riftkeeper would have died, but was saved and put into Stasis for 1 turn. This cannot happen again during this mission."
LocHelpText="The Riftkeeper would have died, but was saved and put into Stasis for 1 turn. This cannot happen again during this mission."

[RKStasis X2AbilityTemplate]
LocFriendlyName="Stasis"
LocLongDescription="Completely stuns the target for 1 turn, but renders them immune to any damage or attack."
LocHelpText="Completely stuns the target for 1 turn, but renders them immune to any damage or attack."
LocPromotionPopupText="<Bullet/> Stasis has a <Ability:SelfCooldown/> turn cooldown."

[RKStasis_AoE X2AbilityTemplate]
LocFriendlyName="Greater Stasis"
LocLongDescription="Completely stuns the targets in the area of effect for 1 turn, but renders them immune to any damage or attack."
LocHelpText="Completely stuns the targets for 1 turn, but renders them immune to any damage or attack."
LocPromotionPopupText="<Bullet/> Stasis has a <Ability:SelfCooldown/> turn cooldown."

[X2StatusEffects_RK]
RiftkeeperClosedEffectName="Closed State"
RiftkeeperClosedEffectDesc="The Riftkeeper's shell is closed. It is more resistant to damage in this state."

[RiftkeeperOpen X2AbilityTemplate]
LocFriendlyName="Open Shell"
LocLongDescription="Open the Riftkeeper's shell, reducing armor and resistance against explosive damage but granting access to additional abilities."
LocHelpText="Open the Gatekeeper's shell, reducing armor and resistance against explosive damage but granting access to additional abilities."
LocFlyOverText="Open Shell"

[RiftkeeperClose X2AbilityTemplate]
LocFriendlyName="Close Shell"
LocLongDescription="Close the Riftkeeper's shell, increasing armor and resistance against explosive damages but preventing the use of some abilities."
LocHelpText="Close the Riftkeeper's shell, increasing armor and resistance against explosive damage but preventing the use of some abilities."
LocFlyOverText="Close Shell"

[RiftkeeperClosedEffect X2AbilityTemplate]
LocFriendlyName="Armored Shell"
LocLongDescription="The Riftkeeper's shell is closed. It is more resistant to damage."
LocHelpText="The Riftkeeper gains armor, resistance against explosive damage and defensive bonuses when its outer shell is closed."
LocFlyOverText="Armored Shell"

[RKProtectiveShell X2AbilityTemplate]
LocFriendlyName="Protective Shell"
LocLongDescription="When a Riftkeeper's shell is closed, it is extremely resistant to damage but has only limited offensive options."
LocHelpText="When a Riftkeeper's shell is closed, it is extremely resistant to damage but has only limited offensive options."
LocFlyOverText="Protective Shell"

[RKRetract X2AbilityTemplate]
LocFriendlyName="Retract"
LocLongDescription="If an open Riftkeeper is hit by an attack and takes damage, it is likely to retract into its shell."
LocHelpText="The Riftkeeper retracts its defensive shell when damaged."
LocFlyOverText="Retract"

[CorpseRiftkeeper X2ItemTemplate]
FriendlyName="Riftkeeper Shell"
FriendlyNamePlural="Riftkeeper Shells"
BriefSummary="Similar to its smaller cousin the organism within the Riftkeeper's shell is highly unusual. So far we were not able to discern any noticable biological differences between the two speies. We can only speculate why so few specimen inhabit the far more dangerous shell of the Riftkeeper."

[AutopsyRiftkeeper X2TechTemplate]
DisplayName="Riftkeeper Autopsy"
Summary="This creature has the unique ability to create small rifts in the very fabric of reality. While it is certain that our limited understanding of the universe precludes us from recreating this technology to its fullest, we may be able to prototype a miniature version of it."
CodeName="Scotty"
LongDescription="Allthough we are certain, that the psionic potential of the species that inhabits the gatekeeper and riftkeeper shells is tremendous, we now know, that its shell plays a large part in how these talents manifest.\n\n Unlike its smaller brethren, the Riftkeeper is indeed capable of opening small dimensional rifts near its position. While these rifts are inherently unstable, they are large enough to allow small groups of reinforcements to pass through them."
AlertString="Riftkeeper"

[RiftBeaconThrow X2AbilityTemplate]
LocFriendlyName="Rift Beacon"
LocHelpText="Opens a small dimensional rift that allows the Avenger crew to send reinforcements."
LocLongDescription="The explosion of the Rift Beacon imbues the surrounding air with psionic particles. This allows us to open a dimensional rift and send reinforcements. The location of the Rift is highly unpredictable but centered around the Beacon's location."

[RiftBeaconDamage X2AbilityTemplate]
LocFriendlyName="Rift Beacon"
LocHelpText="Opens a small dimensional rift that allows the Avenger crew to send reinforcements."
LocLongDescription="The explosion of the Rift Beacon imbues the surrounding air with psionic particles. This allows us to open a dimensional rift and send reinforcements. The location of the Rift is highly unpredictable but centered around the Beacon's location."

[RiftBeacon X2WeaponTemplate]
FriendlyName="Rift Beacon"
FriendlyNamePlural="Rift Beacons"
BriefSummary="The Rift Beacon imbues the surrounding air with psionic particles. These particles act as a beacon for the Avenger's own Dimensional Rift Generator, allowing us to send reinforcements to any given target location. It is deployed like a grenade and is destroyed after a single use. The Dimensional Rift Generator needs to recharge after activation, preventing this item to be used more than once per mission."
TacticalText="<Bullet/> Rift Beacons imbue the surrounding air with psionic particles allowing us to send in reinforcments once per mission.\n<Bullet/> The location of the Rift is highly unpredictable but centered around the Beacon's location.\n<Bullet/> Only one Rift can be opened each mission.\n<Bullet/> The Rift Beacon is destroyed after a single use."

[RiftAnchor X2EquipmentTemplate]
FriendlyName="Rift Anchor"
FriendlyNamePlural="Rift Anchors"
BriefSummary="This Item acts as an anchor for the Avenger's Dimensional Rift Generator. Soldiers wearing it are prioritized when a Rift Beacon is used. Note: This Item has no use in a tactical mission itself. Soldiers that are training, injured or otherwise occupied can not be summoned via Rift Beacon."
TacticalText="<Bullet/> Equip this item to prioritize the wearer when a Rift Beacon is used.\n<Bullet/> Has no use in a tactical mission.\n<Bullet/> Soldiers that are training, injured or otherwise occupied can not be summoned via Rift Beacon."